import Encoder from "../../encoder.js";

export default {
    normalize: true,
    dedupe: true
};

// import { pipeline, regex } from "../../lang.js";
//
// export const rtl = false;
// export const tokenize = "";
// export default {
//     encode: encode,
//     rtl: rtl,
//     tokenize: tokenize
// }
//
// // p{Z} = whitespaces
// // p{S} = symbols (emotes)
// // p{P} = special chars
// // p{C} = controls (linebreak, tabulator)
// const whitespace = /[\p{Z}\p{S}\p{P}\p{C}]+/u;
// const normalize = "".normalize && /[\u0300-\u036f]/g;
// const pairs = !normalize && new Map([
//
//     // Charset Normalization
//     // String.normalize("NFKD").replace(/[\u0300-\u036f]/g, "")
//
//     ["ª","a"],
//     ["²","2"],
//     ["³","3"],
//     ["¹","1"],
//     ["º","o"],
//     ["¼","1⁄4"],
//     ["½","1⁄2"],
//     ["¾","3⁄4"],
//     ["à","a"],
//     ["á","a"],
//     ["â","a"],
//     ["ã","a"],
//     ["ä","a"],
//     ["å","a"],
//     ["ç","c"],
//     ["è","e"],
//     ["é","e"],
//     ["ê","e"],
//     ["ë","e"],
//     ["ì","i"],
//     ["í","i"],
//     ["î","i"],
//     ["ï","i"],
//     ["ñ","n"],
//     ["ò","o"],
//     ["ó","o"],
//     ["ô","o"],
//     ["õ","o"],
//     ["ö","o"],
//     ["ù","u"],
//     ["ú","u"],
//     ["û","u"],
//     ["ü","u"],
//     ["ý","y"],
//     ["ÿ","y"],
//     ["ā","a"],
//     ["ă","a"],
//     ["ą","a"],
//     ["ć","c"],
//     ["ĉ","c"],
//     ["ċ","c"],
//     ["č","c"],
//     ["ď","d"],
//     ["ē","e"],
//     ["ĕ","e"],
//     ["ė","e"],
//     ["ę","e"],
//     ["ě","e"],
//     ["ĝ","g"],
//     ["ğ","g"],
//     ["ġ","g"],
//     ["ģ","g"],
//     ["ĥ","h"],
//     ["ĩ","i"],
//     ["ī","i"],
//     ["ĭ","i"],
//     ["į","i"],
//     ["ĳ","ij"],
//     ["ĵ","j"],
//     ["ķ","k"],
//     ["ĺ","l"],
//     ["ļ","l"],
//     ["ľ","l"],
//     ["ŀ","l"],
//     ["ń","n"],
//     ["ņ","n"],
//     ["ň","n"],
//     ["ŉ","n"],
//     ["ō","o"],
//     ["ŏ","o"],
//     ["ő","o"],
//     ["ŕ","r"],
//     ["ŗ","r"],
//     ["ř","r"],
//     ["ś","s"],
//     ["ŝ","s"],
//     ["ş","s"],
//     ["š","s"],
//     ["ţ","t"],
//     ["ť","t"],
//     ["ũ","u"],
//     ["ū","u"],
//     ["ŭ","u"],
//     ["ů","u"],
//     ["ű","u"],
//     ["ų","u"],
//     ["ŵ","w"],
//     ["ŷ","y"],
//     ["ź","z"],
//     ["ż","z"],
//     ["ž","z"],
//     ["ſ","s"],
//     ["ơ","o"],
//     ["ư","u"],
//     ["ǆ","dz"],
//     ["ǉ","lj"],
//     ["ǌ","nj"],
//     ["ǎ","a"],
//     ["ǐ","i"],
//     ["ǒ","o"],
//     ["ǔ","u"],
//     ["ǖ","u"],
//     ["ǘ","u"],
//     ["ǚ","u"],
//     ["ǜ","u"],
//     ["ǟ","a"],
//     ["ǡ","a"],
//     ["ǣ","ae"],
//     ["æ","ae"],
//     ["ǽ","ae"],
//     ["ǧ","g"],
//     ["ǩ","k"],
//     ["ǫ","o"],
//     ["ǭ","o"],
//     ["ǯ","ʒ"],
//     ["ǰ","j"],
//     ["ǳ","dz"],
//     ["ǵ","g"],
//     ["ǹ","n"],
//     ["ǻ","a"],
//     ["ǿ","ø"],
//     ["ȁ","a"],
//     ["ȃ","a"],
//     ["ȅ","e"],
//     ["ȇ","e"],
//     ["ȉ","i"],
//     ["ȋ","i"],
//     ["ȍ","o"],
//     ["ȏ","o"],
//     ["ȑ","r"],
//     ["ȓ","r"],
//     ["ȕ","u"],
//     ["ȗ","u"],
//     ["ș","s"],
//     ["ț","t"],
//     ["ȟ","h"],
//     ["ȧ","a"],
//     ["ȩ","e"],
//     ["ȫ","o"],
//     ["ȭ","o"],
//     ["ȯ","o"],
//     ["ȱ","o"],
//     ["ȳ","y"],
//     ["ʰ","h"],
//     ["ʱ","h"],
//     ["ɦ","h"],
//     ["ʲ","j"],
//     ["ʳ","r"],
//     ["ʴ","ɹ"],
//     ["ʵ","ɻ"],
//     ["ʶ","ʁ"],
//     ["ʷ","w"],
//     ["ʸ","y"],
//     ["ˠ","ɣ"],
//     ["ˡ","l"],
//     ["ˢ","s"],
//     ["ˣ","x"],
//     ["ˤ","ʕ"],
//     ["ΐ","ι"],
//     ["ά","α"],
//     ["έ","ε"],
//     ["ή","η"],
//     ["ί","ι"],
//     ["ΰ","υ"],
//     ["ϊ","ι"],
//     ["ϋ","υ"],
//     ["ό","ο"],
//     ["ύ","υ"],
//     ["ώ","ω"],
//     ["ϐ","β"],
//     ["ϑ","θ"],
//     ["ϒ","Υ"],
//     ["ϓ","Υ"],
//     ["ϔ","Υ"],
//     ["ϕ","φ"],
//     ["ϖ","π"],
//     ["ϰ","κ"],
//     ["ϱ","ρ"],
//     ["ϲ","ς"],
//     ["ϵ","ε"],
//     ["й","и"],
//     ["ѐ","е"],
//     ["ё","е"],
//     ["ѓ","г"],
//     ["ї","і"],
//     ["ќ","к"],
//     ["ѝ","и"],
//     ["ў","у"],
//     ["ѷ","ѵ"],
//     ["ӂ","ж"],
//     ["ӑ","а"],
//     ["ӓ","а"],
//     ["ӗ","е"],
//     ["ӛ","ә"],
//     ["ӝ","ж"],
//     ["ӟ","з"],
//     ["ӣ","и"],
//     ["ӥ","и"],
//     ["ӧ","о"],
//     ["ӫ","ө"],
//     ["ӭ","э"],
//     ["ӯ","у"],
//     ["ӱ","у"],
//     ["ӳ","у"],
//     ["ӵ","ч"]
//
//     // Charset Normalization
//
//     // ["à", "a"],
//     // ["á", "a"],
//     // ["â", "a"],
//     // ["ã", "a"],
//     // ["ä", "a"],
//     // ["å", "a"],
//     //
//     // ["è", "e"],
//     // ["é", "e"],
//     // ["ê", "e"],
//     // ["ë", "e"],
//     //
//     // ["ì", "i"],
//     // ["í", "i"],
//     // ["î", "i"],
//     // ["ï", "i"],
//     //
//     // ["ò", "o"],
//     // ["ó", "o"],
//     // ["ô", "o"],
//     // ["õ", "o"],
//     // ["ö", "o"],
//     // ["ő", "o"],
//     //
//     // ["ù", "u"],
//     // ["ú", "u"],
//     // ["û", "u"],
//     // ["ü", "u"],
//     // ["ű", "u"],
//     //
//     // ["ý", "y"],
//     // ["ŷ", "y"],
//     // ["ÿ", "y"],
//     //
//     // ["ñ", "n"],
//     // ["ç", "c"],
//     // ["ß", "s"]
//
//     // Special Chars Removal
//
//     // [",", ""],
//     // [".", ""],
//     // ["'", ""]
//
//     // Non-Whitespace Separators
//
//     // split by default p{P}
//     // ["-", " "],
//     // [":", " "],
//     // ["_", " "],
//     // ["|", " "],
//     // ["/", " "],
//     // ["\\", " "]
// ]);
//
// // let pairs;
// //
// // if(!normalize){
// //
// //     // Charset Normalization
// //
// //     const regex_a = regex("[àáâãäå]"),
// //         regex_e = regex("[èéêë]"),
// //         regex_i = regex("[ìíîï]"),
// //         regex_o = regex("[òóôõöő]"),
// //         regex_u = regex("[ùúûüű]"),
// //         regex_y = regex("[ýŷÿ]"),
// //         regex_n = regex("ñ"),
// //         //regex_c = regex("[çc]"),
// //         regex_c = regex("ç"),
// //         regex_s = regex("ß"),
// //         //regex_and = regex(" & "),
// //         regex_and = regex("&");
// //
// //     pairs = [
// //         regex_a, "a",
// //         regex_e, "e",
// //         regex_i, "i",
// //         regex_o, "o",
// //         regex_u, "u",
// //         regex_y, "y",
// //         regex_n, "n",
// //         //regex_c, "k",
// //         regex_c, "c",
// //         regex_s, "s",
// //         regex_and, " and "
// //     ];
// // }
//
// /**
//  * @param {string|number} str
//  */
//
// export function encode(str){
//
//     //str = "" + str;
//
//     return pipeline.call(
//
//         this,
//         /* string: */ (/*normalize ? str.normalize("NFD").replace(normalize, "") :*/ "" + str).toLowerCase(),
//         /* normalize: */ pairs,
//         /* split: */ whitespace,
//         ///* collapse: */ false
//     );
// }
